#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
偶斐波那契数
斐波那契数列中的每一项都是前两项的和。由1和2开始生成的斐波那契数列前10项为：

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, …
考虑该斐波那契数列中不超过四百万的项，求其中为偶数的项之和。

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987
求偶数项之和，我们看到第二个+第四个=第五个-1（2+5=8-1）、（2+5+13=21-1）

求所有偶数的和
"""

def fibonacci(ask):
    x, y, result = 1, 2, 0
    
    count = 2
    while y <= ask:
        if count % 2 == 0:
            result += y
        x, y = y, x + y
        count += 1

    return result

print(fibonacci(4000000))
