#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
利克瑞尔数
将47倒序并相加得到47 + 74 = 121，是一个回文数。
不是所有的数都能像这样迅速地变成回文数。例如，
349 + 943 = 1292
1292 + 2921 = 4213
4213 + 3124 = 7337
也就是说，349需要迭代三次才能变成回文数。
尽管尚未被证实，但有些数，例如196，被认为永远不可能变成回文数。如果一个数永远不可能通过倒序并相加变成回文数，就被称为利
克瑞尔数。出于理论的限制和问题的要求，在未被证否之前，我们姑且就认为这些数确实是利克瑞尔数。除此之外，已知对于任意一个小
于一万的数，它要么在迭代50次以内变成回文数，要么就是没有人能够利用现今所有的计算能力将其迭代变成回文数。事实上，10677是
第一个需要超过50次迭代变成回文数的数，这个回文数是4668731596684224866951378664（53次迭代，28位数）。
令人惊讶的是，有些回文数本身也是利克瑞尔数数；第一个例子是4994。
小于一万的数中有多少利克瑞尔数？

注意：2007年4月24日，题目略作修改，以强调目前利克瑞尔数理论的限制。

分析：
找到迭代50次以内能变成回文数的数
"""
def is_palindrome(n):  # 回文检测
    return str(n) == str(n)[::-1]

def xxx():
    count = 0
    for i in range(1, 10000):
        yes_or_no = i
        for j in range(50):
            yes_or_no += int(str(yes_or_no)[::-1])
            if is_palindrome(yes_or_no):
                count += 1
                break
    return count